# Найти сумму чисел списка стоящих на нечетной позиции

list = [1, 2, 3, 5, 1, 5, 3, 10]
list = [list[i] for i in range(len(list)) if not i%2]
sum = 0
s = lambda s, x: s + x
p = lambda l, x:
print(list)


# l = lambda s,x: s + x
# list = 
# sum = 0